hiperiondev/esp32idf_APRS/components/esp32idf_radioamateur_modem/src/afsk.c
// Over-range reporting. s_clipWarn is the operator's selection; s_clipNextWarnMs
// is the millisecond timestamp before which no further warning is emitted, kept
// as a deadline rather than a countdown so the comparison stays correct across
// the 32-bit wrap.
static bool s_clipWarn = false;
static uint32_t s_clipNextWarnMs = 0;

// Raw conversion results this close to either end of the 12-bit range are taken
// as over-range: the last few codes are already outside the converter's usable
// window, and on an interface without input clamp diodes reaching them also
// means the pin is being driven past the supply rails.
#define CLIP_RAW_LOW      15
#define CLIP_RAW_HIGH     4080
#define CLIP_WARN_HOLD_MS 5000

// DAC sample rate the modulator is programmed for. Fixed while the modem runs:
// AFSK_init() turns it into the sample-clock alarm period and ModemInit() turns
// it into the tone phase steps and the baud-rate divider, so it is only writable
// while the hardware is stopped.
static uint32_t s_dacRate = MODEM_DAC_SAMPLERATE;

// Selection state of the ADC pad's internal input bias.
static bool s_adcSelfBias = false;

// Running DC average of the raw ADC stream, used to re-centre the samples
// before demodulation.
#define AVG_N 125
static uint16_t s_avgBuf[AVG_N];
static uint8_t s_avgIdx = 0;
static int s_avgSum = 0;
static uint16_t s_avg = 2048;

// DAC idle/centre code and amplitude scaling.
//
// IRAM_ATTR: called directly from dac_timer_isr(), which is itself IRAM_ATTR.
// A plain "static inline" is only a hint - at CONFIG_COMPILER_OPTIMIZATION_DEBUG
// (-Og), GCC frequently declines it, and an un-inlined static function is
// placed in flash by default. That introduces the exact XIP-fetch jitter the
// other ISR-path functions on the transmit side (dac_write_isr() here,
// calculateCRC() in ax25.c) are IRAM_ATTR to avoid.
#define DAC_MID 128

// Peak-to-peak swing of the DAC output, in percent of the full range. Written
// only by afskSetDacAmplitude() (task context) and read by dac_scale() in the
// DAC timer ISR: a single-byte load, so the ISR either sees the old value or
// the new one and never a torn intermediate. A change therefore takes effect
// on the next sample, without stopping the modulator.
static uint8_t s_dacAmplitudePct = MODEM_DAC_AMPLITUDE_PCT;

static inline uint8_t IRAM_ATTR dac_scale(uint8_t s) {
    int v = DAC_MID + (((int)s - DAC_MID) * (int)s_dacAmplitudePct) / 100;
    if (v < 0)
        v = 0;
    if (v > 255)
        v = 255;
    return (uint8_t)v;
}

// ------------------------------------------------------------------
// AGC / resampler
// ------------------------------------------------------------------

#define AGC_TARGET_RMS 0.2f // target RMS level (-10 dBFS)

// Attack = gain coming DOWN because the signal is too loud. It must be fast:
// an overdriven demodulator decodes nothing. Release = gain going UP on a quiet
// signal, and must be slow so noise between frames does not pump the gain.
#define AGC_ATTACK   0.05f
#define AGC_RELEASE  0.002f
#define AGC_MAX_GAIN 8.0f
#define AGC_MIN_GAIN 0.1f

// Below this block RMS there is nothing but ADC noise, so there is no
// meaningful level to track.
#define AGC_SQUELCH_RMS 0.01f

// Most the gain may change in a single 20 ms block. Without this a single
// near-silent block drives error towards infinity and slams the gain to the
// rail in one step.
#define AGC_MAX_STEP 2.0f

// @brief Track the input level.
//
// Only call this when a signal is actually present. Between frames the DAC is
// parked at mid-scale and the DC tracker removes it, so the block RMS is
// essentially zero; adapting on that would compute AGC_TARGET_RMS/~0, peg the
// gain at AGC_MAX_GAIN, and hand the next transmission to the demodulator
// roughly 10x overdriven - well past the 13 bits demodulate() accepts, which
// overflows the int32 accumulator in filterRun() (the 15-tap AFSK300 BPF is the
// first to go) and wraps the int16 cast on the correlator output, inverting the
// symbol decision, so every profile would decode zero frames.
static float update_agc(const float *buf, size_t len) {
    float sum_sq = 0;
    for (size_t i = 0; i < len; i++)
        sum_sq += buf[i] * buf[i];

    float rms = sqrtf(sum_sq / (float)len);
    if (rms < AGC_SQUELCH_RMS)
        return s_agcGain; // noise only - hold the gain where it is

    float error = AGC_TARGET_RMS / rms;
    if (error > AGC_MAX_STEP)
        error = AGC_MAX_STEP;
    else if (error < 1.0f / AGC_MAX_STEP)
        error = 1.0f / AGC_MAX_STEP;

    float rate = (error < 1.0f) ? AGC_ATTACK : AGC_RELEASE;

    s_agcGain += (s_agcGain * error - s_agcGain) * rate;
    s_agcGain = fmaxf(fminf(s_agcGain, AGC_MAX_GAIN), AGC_MIN_GAIN);
    return s_agcGain;
}

// Anti-alias FIR for the MODEM_ADC_SAMPLERATE -> 9600 Hz decimation.
//
// The cutoff is fixed by the job: 4800 Hz, the 9600 Hz Nyquist. The LENGTH is
// not - it is set by the ratio, because the cutoff is what matters in NORMALISED
// terms and that halves when the input rate doubles. The 8-tap set below was cut
// for 38400 -> 9600 (4:1, normalised cutoff 0.125). Reusing it at 76800 -> 9600
// (8:1, normalised 0.0625) does not filter, it just picks every eighth output of
// a filter that is now twice too wide, and the AFSK profiles alias into
// unintelligibility - verified on the host, 48 % BER.
//
// So the taps follow the ratio. Both sets are Hamming-windowed sincs at 4800 Hz
// and both are host-verified to give 0 bit errors on Bell202, V.23 and AFSK300.
#if MODEM_RESAMPLE_RATIO == 8
#define FILTER_TAPS 16
static const float resample_coeffs[FILTER_TAPS] = {
    0.000813f, 0.004002f, 0.013722f, 0.033895f, 0.064417f, 0.100105f, 0.132060f, 0.150986f,
    0.150986f, 0.132060f, 0.100105f, 0.064417f, 0.033895f, 0.013722f, 0.004002f, 0.000813f,
};
#elif MODEM_RESAMPLE_RATIO == 4
#define FILTER_TAPS 8
static const float resample_coeffs[FILTER_TAPS] = {
    0.003560f, 0.038084f, 0.161032f, 0.297324f, 0.297324f, 0.161032f, 0.038084f, 0.003560f,
};
#elif MODEM_RESAMPLE_RATIO == 1
#define FILTER_TAPS 1
static const float resample_coeffs[FILTER_TAPS] = { 1.0f };
#else
#error "No decimation FIR for this MODEM_RESAMPLE_RATIO. Cut one at 4800 Hz for the new ratio; do not reuse a filter designed for a different one."
#endif

#if FILTER_TAPS > 1
// The last FILTER_TAPS - 1 raw samples of the previous block, prepended
// ahead of this one so the filter has real data to draw on instead of
// zeros at the join. A decimator fed block-by-block must carry this
// history between calls.
static float s_resampleTail[FILTER_TAPS - 1];
#endif

