hiperiondev/esp32idf_APRS/components/esp32idf_radioamateur_modem/src/afsk.c
// The decimator filters buf[] into the front of buf[] itself: output i lands in
// buf[i] while the taps read the window that ends at buf[i *
// MODEM_RESAMPLE_RATIO]. Almost none of that overlaps, and the proof is worth
// spelling out because it is what keeps a whole block out of .bss.
//
// The samples output i reads from buf[] sit at indices
// [i * MODEM_RESAMPLE_RATIO - (FILTER_TAPS - 1) .. i * MODEM_RESAMPLE_RATIO].
// Take one such index r with r >= FILTER_TAPS - 1 and suppose the loop had
// already overwritten it, that is r < i. The lower bound with
// MODEM_RESAMPLE_RATIO >= 2 gives r >= 2i - (FILTER_TAPS - 1), and r < i gives
// 2i > 2r, so r > 2r - (FILTER_TAPS - 1), i.e. r < FILTER_TAPS - 1 - which
// contradicts the assumption. So every read that CAN land on an already-written
// slot lies below index FILTER_TAPS - 1, and there are at most FILTER_TAPS - 1
// of them: at ratio 8 they are the reads of buf[0] and buf[1] taken while
// computing outputs 1 and 2.
//
// The filter therefore needs two short runs of history and no full-block copy:
// the previous block's tail (s_resampleTail) and this block's own leading
// FILTER_TAPS - 1 samples. They are staged together in hist[] so that the tap
// index k walks the conceptual [ previous tail ][ this block ] sequence with a
// single bound test; everything from index FILTER_TAPS - 1 upwards is read
// straight out of buf[], still raw.
_Static_assert(MODEM_RESAMPLE_RATIO >= 2 || FILTER_TAPS == 1,
               "In-place decimation needs MODEM_RESAMPLE_RATIO >= 2: at ratio 1 a multi-tap filter reads its own output.");
_Static_assert(MODEM_BLOCK_SIZE >= 2 * (FILTER_TAPS - 1), "MODEM_BLOCK_SIZE must hold the leading and trailing history runs without them overlapping.");

static void resample_audio(float *buf) {
#if FILTER_TAPS > 1
    // [ previous block's tail ][ this block's first FILTER_TAPS - 1 samples ]
    float hist[2 * (FILTER_TAPS - 1)];
    memcpy(hist, s_resampleTail, sizeof(s_resampleTail));
    memcpy(hist + (FILTER_TAPS - 1), buf, (FILTER_TAPS - 1) * sizeof(float));

    // Take this block's own tail now, before the decimation loop runs. The
    // loop only ever writes the first MODEM_BLOCK_SIZE / MODEM_RESAMPLE_RATIO
    // slots and so cannot reach these, but reading them up front means the
    // tail no longer depends on where the write pointer stops.
    for (int t = 0; t < FILTER_TAPS - 1; t++)
        s_resampleTail[t] = buf[MODEM_BLOCK_SIZE - (FILTER_TAPS - 1) + t];
#endif

    for (int i = 0; i < MODEM_BLOCK_SIZE / MODEM_RESAMPLE_RATIO; i++) {
        float sum = 0;
        for (int j = 0; j < FILTER_TAPS; j++) {
#if FILTER_TAPS > 1
            // k indexes the conceptual [ tail ][ block ] sequence; hist[] holds
            // its first 2 * (FILTER_TAPS - 1) entries.
            int k = i * MODEM_RESAMPLE_RATIO + j;
            float in = (k < 2 * (FILTER_TAPS - 1)) ? hist[k] : buf[k - (FILTER_TAPS - 1)];
#else
            float in = buf[i * MODEM_RESAMPLE_RATIO + j]; // MODEM_RESAMPLE_RATIO == 1, reads and writes the same slot
#endif
            sum += in * resample_coeffs[j];
        }
        buf[i] = sum;
    }
}

// ------------------------------------------------------------------
// LEDs / PTT
// ------------------------------------------------------------------

static uint8_t r_old = 0, g_old = 0, b_old = 0;
static int64_t rgbTimeout = 0;

// PTT pin is a fixed compile-time constant (::MODEM_PTT_GPIO, an internal
// radiomodem feature - like ::MODEM_ADC_GPIO / ::MODEM_DAC_GPIO it is not
// runtime/web-admin selectable). Its active level is likewise fixed at
// compile time (::MODEM_PTT_ACTIVE_HIGH) and is not a user-facing polarity
// toggle - AFSK_setPttActiveHigh() is only ever called with that same
// compile-time value, from modem_init()/modem_set_modem(), including once
// live per Radio-page Save (aprs_service_apply_modem_config()) as part of
// re-applying the whole modem config.
//
// s_pttActiveHigh is read from setPtt(), which runs from the DAC timer ISR
// (IRAM_ATTR, fires continuously during TX) - so any change to it from task
// context must be made atomic with respect to that ISR. s_pttMux guards
// exactly that variable; it must never be held around gpio_set_level(), which
// is not guaranteed ISR-safe on this target.
static const int8_t s_pttGpio = MODEM_PTT_GPIO;
static bool s_pttActiveHigh = MODEM_PTT_ACTIVE_HIGH ? true : false;
static portMUX_TYPE s_pttMux = portMUX_INITIALIZER_UNLOCKED;

bool afsk_gpio_is_output_capable(int8_t gpio) {
    if (gpio == -1)
        return true; // "disabled" is always accepted
    if (gpio < 0 || gpio > 39)
        return false;
    if (gpio >= 34 && gpio <= 39)
        return false; // input-only, cannot drive an output
    if (gpio >= 6 && gpio <= 11)
        return false; // internal SPI flash/PSRAM, not brought out
    return true;
}

bool afsk_ptt_gpio_is_valid(int8_t gpio) {
    if (gpio == -1)
        return true; // "disabled" is always accepted
    if (!afsk_gpio_is_output_capable(gpio))
        return false;
    if (gpio == MODEM_ADC_GPIO || gpio == MODEM_DAC_GPIO)
        return false; // already used by the audio front end
    return true;
}

void AFSK_setPttActiveHigh(bool active_high) {
    // setPtt() (IRAM ISR, driven by the DAC timer during TX) reads
    // s_pttActiveHigh on every bit and calls gpio_set_level() on the fixed
    // s_pttGpio pin - it does not know a Save is in progress. The pin itself
    // never changes (it is the compile-time ::MODEM_PTT_GPIO constant), so
    // there is no pin swap to sequence here: only the polarity is updated,
    // under the same spinlock setPtt() uses.
    //
    // The idle level is re-driven here only when nothing is transmitting. The
    // DAC-timer ISR already owns the pin throughout TX and re-asserts the
    // correct level (active or idle, per the current s_pttActiveHigh) on every
    // sample via setPtt(), so while TX is active the write is skipped and any
    // change is applied by setPtt() itself on the very next bit.
    portENTER_CRITICAL(&s_pttMux);
    s_pttActiveHigh = active_high;
    portEXIT_CRITICAL(&s_pttMux);

    if (s_inited && s_pttGpio >= 0 && !getTransmit())
        gpio_set_level((gpio_num_t)s_pttGpio, active_high ? 0 : 1);
}

// IRAM_ATTR: reachable from dac_timer_isr() (IRAM ISR) via setPtt(), which
// runs setPtt(false) directly from Ax25GetTxBit() at key-down. If this ever
// executes while a concurrent flash op (e.g. LittleFS reading bulletins.json)
// has cache disabled, a flash-resident function here panics with
// "Cache disabled but cached memory region accessed".
void IRAM_ATTR LED_Status2(uint8_t r, uint8_t g, uint8_t b) {
    int64_t now = esp_timer_get_time() / 1000;

    if (r == r_old && g == g_old && b == b_old) {
        // Same state as last time: nothing to drive, just keep pushing the
        // "quiet" window out so a burst of identical calls (e.g. once per
        // transmitted bit) does not repeatedly touch the GPIOs. This must
        // NOT gate genuine transitions below - see the note there.
        rgbTimeout = now + 100;
        return;
    }

