hiperiondev/esp32idf_APRS/components/esp32idf_radioamateur_modem/src/afsk.c
    adc_cali_line_fitting_config_t caliCfg = {
        .unit_id = ADC_UNIT_1,
        .atten = MODEM_ADC_ATTEN,
        .bitwidth = ADC_BITWIDTH_12,
    };
    err = adc_cali_create_scheme_line_fitting(&caliCfg, &s_cali);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "adc_cali_create_scheme_line_fitting: %s", esp_err_to_name(err));
        return err;
    }

    return adc_continuous_start(s_adc);
}

// ------------------------------------------------------------------
// RX DSP
// ------------------------------------------------------------------

void AFSK_Poll(void) {
    int16_t adc = 0;
    int mV = 0;
    long mVsum = 0;
    int mVsumCount = 0;

    for (;;) {
        // Only the consumer may move tail, so a flush requested by another task
        // is executed here, between blocks.
        if (s_flushReq) {
            s_flushReq = false;
            s_fifo.tail = s_fifo.head;
        }

        if (rb_size(&s_fifo) < (uint32_t)MODEM_BLOCK_SIZE)
            break;

        mVsum = 0;
        mVsumCount = 0;

        int16_t rawMin = INT16_MAX;
        int16_t rawMax = INT16_MIN;

        // The RMS/level measurement only needs a fraction of the samples.
        int m = ((MODEM_RESAMPLE_RATIO > 1) || (ModemConfig.modem == MODEM_MODEM_G3RUH)) ? 4 : 1;

        for (int x = 0; x < MODEM_BLOCK_SIZE; x++) {
            if (!rb_pop(&s_fifo, &adc))
                break;

            // running DC average
            s_avgSum += adc - (int)s_avgBuf[s_avgIdx];
            s_avgBuf[s_avgIdx++] = (uint16_t)adc;
            if (s_avgIdx >= AVG_N)
                s_avgIdx -= AVG_N;
            s_avg = (uint16_t)(s_avgSum / AVG_N);

            if (adc < rawMin)
                rawMin = adc;
            if (adc > rawMax)
                rawMax = adc;

            int adcVal = (int)adc - (int)s_avg;

            if (x % m == 0) {
                adc_cali_raw_to_voltage(s_cali, adc, &mV);
                mV -= s_offset;
                mVsum += (long)mV * mV; // Vrms = sqrt(1/n * sum(Vi^2))
                mVsumCount++;
            }

            s_audio[x] = (float)adcVal / 2048.0f * s_agcGain;
        }

        adc_cali_raw_to_voltage(s_cali, s_avg, &s_offset);

        if (rawMin <= rawMax) {
            s_rawMin = rawMin;
            s_rawMax = rawMax;

            if (s_clipWarn && ((rawMax >= CLIP_RAW_HIGH) || (rawMin <= CLIP_RAW_LOW))) {
                uint32_t now = (uint32_t)(esp_timer_get_time() / 1000);

                // Signed difference against a deadline, so the hold survives the
                // wrap of the millisecond counter.
                if ((int32_t)(s_clipNextWarnMs - now) <= 0) {
                    s_clipNextWarnMs = now + CLIP_WARN_HOLD_MS;
                    ESP_LOGW(TAG, "RX audio is over-range (raw %d..%d of 0..4095) - lower the receive level trimmer or the transceiver volume", rawMin, rawMax);
                }
            }
        }

        if (mVsumCount > 0) {
            s_mVrms = (int)sqrtf((float)(mVsum / mVsumCount));
            if (s_mVrms > 10) { // > -40 dBm
                if (s_dcdCnt < 100)
                    s_dcdCnt++;
            } else if (s_mVrms < 5) { // < -46 dBm
                if (s_dcdCnt > 0)
                    s_dcdCnt--;
            }
        }

        bool signalPresent = (s_dcdCnt > 3) || (ModemConfig.modem == MODEM_MODEM_G3RUH);

        // Track the level only while there is something to track. Adapting on
        // an idle channel would pin the gain at maximum and overdrive every
        // incoming frame.
        if (signalPresent)
            update_agc(s_audio, MODEM_BLOCK_SIZE);

        if (signalPresent) {
            // G3RUH is the one profile that is NOT decimated.
            //
            // The AFSK profiles are demodulated at MODEM_DEMOD_SAMPLERATE
            // (9600 Hz), so the MODEM_ADC_SAMPLERATE stream is low-pass
            // filtered and decimated by MODEM_RESAMPLE_RATIO first. G3RUH runs
            // at 9600 Bd: decimating to 9600 Hz would leave exactly one sample
            // per symbol, which gives the DPLL nothing to recover a clock from
            // and puts the symbol rate at Nyquist. Its demodulator is built for
            // the raw MODEM_ADC_SAMPLERATE stream instead - MODEM_RESAMPLE_RATIO
            // samples per symbol, which is what N9600 and the lpf9600
            // coefficients in modem.c are cut for. Feed it the undecimated
            // block.
            //
            // The anti-alias filter is skipped with it, deliberately: its 4800
            // Hz cutoff is G3RUH's own bandwidth, so it would take the signal
            // with it. lpf9600 does the receive filtering for this profile.
            const bool decimate = (ModemConfig.modem != MODEM_MODEM_G3RUH) && (MODEM_RESAMPLE_RATIO > 1);
            const int count = decimate ? (MODEM_BLOCK_SIZE / MODEM_RESAMPLE_RATIO) : MODEM_BLOCK_SIZE;

            if (decimate)
                resample_audio(s_audio);

            for (int i = 0; i < count; i++) {
                // demodulate() is documented for <= 13 bit input, and
                // filterRun() accumulates coeff*sample in an int32 across up to
                // 15 taps. Clamping here keeps both safe no matter what the AGC
                // or a hot input does.
                float v = s_audio[i] * 2048.0f;
                if (v > 2047.0f)
                    v = 2047.0f;
                else if (v < -2047.0f)
                    v = -2047.0f;
                MODEM_DECODE((int16_t)v, (uint16_t)s_mVrms);
            }
        }
    }
}

static void afsk_rx_task(void *arg) {
    (void)arg;

    // One conversion frame - MODEM_ADC_CONV_FRAME samples, not a whole DSP
    // block. adc_continuous_read() hands back at most one frame per call, and
    // AFSK_Poll() below only acts once MODEM_BLOCK_SIZE samples have
    // accumulated in the FIFO, so a short read costs nothing but a loop.
    // Static rather than automatic so that a conversion frame never has to be
    // carried on this task's stack.
    static uint8_t convBuf[MODEM_ADC_CONV_FRAME_BYTES];

